BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega128RFR2.PIC
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="SCTSTRHL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSTRHL" edc:desc="Symbol Counter Transmit Frame Timestamp Register HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFC" edc:access="nnnnnnnn" edc:cname="SCTSTRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSTRHH" edc:desc="Symbol Counter Transmit Frame Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xFD" edc:offset="0xF"/>
        <edc:SFRDef edc:_addr="0x10C" edc:access="nnnnnnnn" edc:cname="MAFCR0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAF0EN" edc:desc="Multiple Address Filter 0 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAF1EN" edc:desc="Multiple Address Filter 1 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAF2EN" edc:desc="Multiple Address Filter 2 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAF3EN" edc:desc="Multiple Address Filter 3 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x10D" edc:access="nnnnnnnn" edc:cname="MAFCR1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AACK_0_I_AM_COORD" edc:desc="Enable PAN Coordinator mode for address filter 0." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_0_SET_PD" edc:desc="Set Data Pending bit for address filter 0." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_1_I_AM_COORD" edc:desc="Enable PAN Coordinator mode for address filter 1." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_1_SET_PD" edc:desc="Set Data Pending bit for address filter 1." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_2_I_AM_COORD" edc:desc="Enable PAN Coordinator mode for address filter 2." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_2_SET_PD" edc:desc="Set Data Pending bit for address filter 2." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_3_I_AM_COORD" edc:desc="Enable PAN Coordinator mode for address filter 3." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_3_SET_PD" edc:desc="Set Data Pending bit for address filter 3." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x10E" edc:access="nnnnnnnn" edc:cname="MAFSA0L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA0L" edc:desc="MAC Short Address low Byte for Frame Filter 0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x10F" edc:access="nnnnnnnn" edc:cname="MAFSA0H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA0H" edc:desc="MAC Short Address high Byte for Frame Filter 0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x110" edc:access="nnnnnnnn" edc:cname="MAFPA0L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA0L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x111" edc:access="nnnnnnnn" edc:cname="MAFPA0H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA0H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x112" edc:access="nnnnnnnn" edc:cname="MAFSA1L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA1L" edc:desc="MAC Short Address low Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x113" edc:access="nnnnnnnn" edc:cname="MAFSA1H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA1H" edc:desc="MAC Short Address high Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x114" edc:access="nnnnnnnn" edc:cname="MAFPA1L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA1L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x115" edc:access="nnnnnnnn" edc:cname="MAFPA1H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA1H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x116" edc:access="nnnnnnnn" edc:cname="MAFSA2L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA2L" edc:desc="MAC Short Address low Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x117" edc:access="nnnnnnnn" edc:cname="MAFSA2H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA2H" edc:desc="MAC Short Address high Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x118" edc:access="nnnnnnnn" edc:cname="MAFPA2L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA2L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x119" edc:access="nnnnnnnn" edc:cname="MAFPA2H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA2H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
